In [1]:
import pandas as pd

In [2]:
s1=pd.Series(['Sanjay   ','###Abhijeet','Maha#& dev','*** Pallavi ***','Govind$#$','Roh   it','S #$upriya'])
print(s1)
s2 =pd.Series([25,26,32,34,25,75,14])
print(s2)

0          Sanjay
1        ###Abhijeet
2         Maha#& dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
dtype: object
0    25
1    26
2    32
3    34
4    25
5    75
6    14
dtype: int64

In [3]:
d=pd.DataFrame({'Name':s1,'Age':s2})
d

              Name  Age
0        Sanjay      25
1      ###Abhijeet   26
2       Maha#& dev   32
3  *** Pallavi ***   34
4        Govind$#$   25
5         Roh   it   75
6       S #$upriya   14

In [4]:
# First convert data frame to Series by specifying column name or index and then apply string methods on series.
# String methods are not applicable on dataframe

In [5]:
for i in d.loc[:,'Name']:
    print(''.join(char for char in i if char.isalnum()))

Sanjay
Abhijeet
Mahadev
Pallavi
Govind
Rohit
Supriya

In [6]:
# If we want to access column with name 0(digit) we cant access it like s.0 instead we can access it as 
#s[0]

In [7]:
# Boolean can be used as an indexing. It will return column whose boolean value is True
d.loc[:3,[True,False]]

              Name
0        Sanjay
1      ###Abhijeet
2       Maha#& dev
3  *** Pallavi ***

In [8]:
d.loc[[True,False,False,False,True,False,True],[True,False]]

         Name
0   Sanjay
4   Govind$#$
6  S #$upriya

In [9]:
# To find names of dataframe ending with t we first have to convert datframe to series. so that we can apply string methods
s3=d.loc[:,'Name']
s3

0          Sanjay
1        ###Abhijeet
2         Maha#& dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
Name: Name, dtype: object

In [11]:
s3.str.endswith('t')

0    False
1     True
2    False
3    False
4    False
5     True
6    False
Name: Name, dtype: bool

In [12]:
s3[s3.str.endswith('t')]

1    ###Abhijeet
5       Roh   it
Name: Name, dtype: object

In [13]:
#################### How to deal with datatype of data frame##############################

In [14]:
df1 = pd.DataFrame([10,20,30,40])
df1

    0
0  10
1  20
2  30
3  40

In [15]:
df1.dtypes          # Data type of data frame is int 64

0    int64
dtype: object

In [16]:
# Explicite type casting while creation
df2 = pd.DataFrame([10,20,30,40],dtype='int32')
print(df2)
print(df2.dtypes)

    0
0  10
1  20
2  30
3  40
0    int32
dtype: object

# Explicite type casting after creation using astype

In [22]:
e = df2.astype('f2')    # float16
e

      0
0  10.0
1  20.0
2  30.0
3  40.0

In [23]:
e.dtypes

0    float16
dtype: object

In [24]:
# Use case

In [25]:
d=pd.DataFrame(['1','2','3'])
d

   0
0  1
1  2
2  3

In [26]:
d.dtypes       # As data is in string format

0    object
dtype: object

In [27]:
e = d.astype('int32')

In [28]:
e.dtypes

0    int32
dtype: object

In [29]:
d = pd.DataFrame([35,12,14,5,8,18])
d

    0
0  35
1  12
2  14
3   5
4   8
5  18

In [30]:
# Conditional Selection

In [32]:
d>10     # Returns DataFrame

       0
0   True
1   True
2   True
3  False
4  False
5   True

In [33]:
d[0]>10        # Returns Series

0     True
1     True
2     True
3    False
4    False
5     True
Name: 0, dtype: bool

In [34]:
d[d>10]      # Using DataFrame Directly as an index, gives NaN for false value.
              #convert all other values of that column to float

      0
0  35.0
1  12.0
2  14.0
3   NaN
4   NaN
5  18.0

In [35]:
d[d[0]>10]     # DataFrame using series as a condition without NaN

    0
0  35
1  12
2  14
5  18

# Applying where clouse

In [1]:
# It replace the values where the condition is false

In [1]:
import pandas as pd
d = pd.DataFrame([35,12,14,5,8,18])
d

    0
0  35
1  12
2  14
3   5
4   8
5  18

In [2]:
d.where(d>10)  # IF condition is False it replaces the value by NaN
# We an also write d.where(d[0]>10)

      0
0  35.0
1  12.0
2  14.0
3   NaN
4   NaN
5  18.0

In [3]:
d.where(d>10,other=0)  # If other is provided then it insert value of other to evry value which is not satisfying condition
# It can be writen as d.where(d>10,0)

    0
0  35
1  12
2  14
3   0
4   0
5  18

In [4]:
d.where(d>10,d.mean(),axis=1)   # As it is 2D we have to specify axis for mean calculation
# It can be written as d.where(d[0]>10,d[0].mean())

           0
0  35.000000
1  12.000000
2  14.000000
3  15.333333
4  15.333333
5  18.000000

In [5]:
d.where(d[0]>10,-d)     # It will substitute negative value at a place where condition becomes False

    0
0  35
1  12
2  14
3  -5
4  -8
5  18

In [6]:
import numpy as np
d1 = pd.DataFrame(np.random.rand(4,4))
d1

          0         1         2         3
0  0.501855  0.940155  0.511233  0.514760
1  0.777058  0.706809  0.095756  0.250004
2  0.547358  0.065840  0.341009  0.835759
3  0.114632  0.638780  0.272101  0.196124

In [7]:
d1.where(d1<0.5,d1.mean(),axis=0)

          0         1         2         3
0  0.485226  0.485226  0.485226  0.485226
1  0.587896  0.587896  0.095756  0.250004
2  0.305025  0.065840  0.341009  0.305025
3  0.114632  0.449162  0.272101  0.196124

In [8]:
q = pd.DataFrame(np.random.random((5,5)),columns=list('abcde'))
q

          a         b         c         d         e
0  0.590221  0.311042  0.163844  0.188379  0.272795
1  0.127677  0.046024  0.326580  0.598821  0.904710
2  0.109653  0.354877  0.542201  0.661312  0.360605
3  0.075124  0.013015  0.377664  0.716115  0.055861
4  0.350990  0.960301  0.282603  0.024662  0.026971

In [9]:
q[:1]

          a         b         c         d         e
0  0.590221  0.311042  0.163844  0.188379  0.272795

In [10]:
q.d     # Return a series
# q['d']   Also returns a series

0    0.188379
1    0.598821
2    0.661312
3    0.716115
4    0.024662
Name: d, dtype: float64

In [11]:
q[['d']]      # Return a DataFrame

          d
0  0.188379
1  0.598821
2  0.661312
3  0.716115
4  0.024662

In [12]:
q['d']    # It returns a series

0    0.188379
1    0.598821
2    0.661312
3    0.716115
4    0.024662
Name: d, dtype: float64

In [17]:
q['d'].where(q['d']>0.3)

0         NaN
1    0.598821
2    0.661312
3    0.716115
4         NaN
Name: d, dtype: float64

In [ ]:
# Mask- It is exactly aposite of where. It will substitute value if condition is true otherwise keep as it is.

In [16]:
q['d'].mask(q['d']>0.3)     # Output is in yhe format of series

0    0.188379
1         NaN
2         NaN
3         NaN
4    0.024662
Name: d, dtype: float64

In [20]:
q[['d']].mask(q['d']>0.3)

          d
0  0.188379
1       NaN
2       NaN
3       NaN
4  0.024662

In [22]:
q[['d']].mask(q['d']>0.3,-q[['d']])     # like -d in series we can use -q[['d']] for dataframe

          d
0  0.188379
1 -0.598821
2 -0.661312
3 -0.716115
4  0.024662

In [1]:
import pandas as pd
df = pd.DataFrame({'A': range(1, 6),
                   'B': range(10, 0, -2),
                   'C': range(10, 15)})
df

   A   B   C
0  1  10  10
1  2   8  11
2  3   6  12
3  4   4  13
4  5   2  14

In [2]:
df.query('A>B')      # A and B are the two columns provide condition in between them

   A  B   C
4  5  2  14

In [3]:
df[df['A']==3 ]['B']     # Return value of column B for chich condition of A satisfies

2    6
Name: B, dtype: int64

In [4]:
df.query('A==3').B      # Return value of column B for chich condition of A satisfies

2    6
Name: B, dtype: int64

In [5]:
# To fetch value of column A and B which satisfies condition
df.query('A==3')[['A','B']]

   A  B
2  3  6

In [6]:
df[df['A']==3][['A','B']]

   A  B
2  3  6

In [7]:
df['A']+df['B']

0    11
1    10
2     9
3     8
4     7
dtype: int64

In [8]:
df.eval(df.A+df.B)

array([11, 10, 9, 8, 7], dtype=object)

In [9]:
df.eval('A+C')

0    11
1    13
2    15
3    17
4    19
dtype: int64

In [10]:
df = pd.DataFrame({'name':['Ashwin','Sanjay','Smita','Vaibhav','Abhijeet','Mahadev','Supriya','Pallavi','Sumeet','Chidambar','Subhash'],
                  'place':['Pune','Satara','Sangli','Solapur','Kolhapur','Pune','Satara','Sangli','Solapur','Pune','Satara'],
                  'age':[42,20,25,36,28,24,45,25,21,19,45]})
df

         name     place  age
0      Ashwin      Pune   42
1      Sanjay    Satara   20
2       Smita    Sangli   25
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
8      Sumeet   Solapur   21
9   Chidambar      Pune   19
10    Subhash    Satara   45

In [11]:
#How many records are there?
#records means no. rows
len(df)

11

In [12]:
df.shape[0]

11

In [13]:
df.name.tolist()    #To create list of all entries in any column

['Ashwin',
 'Sanjay',
 'Smita',
 'Vaibhav',
 'Abhijeet',
 'Mahadev',
 'Supriya',
 'Pallavi',
 'Sumeet',
 'Chidambar',
 'Subhash']

In [14]:
df.name.to_dict()

{0: 'Ashwin',
 1: 'Sanjay',
 2: 'Smita',
 3: 'Vaibhav',
 4: 'Abhijeet',
 5: 'Mahadev',
 6: 'Supriya',
 7: 'Pallavi',
 8: 'Sumeet',
 9: 'Chidambar',
 10: 'Subhash'}

In [15]:
dict(df.name)

{0: 'Ashwin',
 1: 'Sanjay',
 2: 'Smita',
 3: 'Vaibhav',
 4: 'Abhijeet',
 5: 'Mahadev',
 6: 'Supriya',
 7: 'Pallavi',
 8: 'Sumeet',
 9: 'Chidambar',
 10: 'Subhash'}

In [16]:
d={}
d['name']=df.name          # Output is dictionary and it is in the form key,value
d

{'name': 0        Ashwin
 1        Sanjay
 2         Smita
 3       Vaibhav
 4      Abhijeet
 5       Mahadev
 6       Supriya
 7       Pallavi
 8        Sumeet
 9     Chidambar
 10      Subhash
 Name: name, dtype: object}

In [17]:
df.name.values          # Output is array of names

array(['Ashwin', 'Sanjay', 'Smita', 'Vaibhav', 'Abhijeet', 'Mahadev',
       'Supriya', 'Pallavi', 'Sumeet', 'Chidambar', 'Subhash'],
      dtype=object)

In [18]:
df.columns

Index(['name', 'place', 'age'], dtype='object')

In [19]:
df.head(2)

     name   place  age
0  Ashwin    Pune   42
1  Sanjay  Satara   20

In [20]:
df[:3]

     name   place  age
0  Ashwin    Pune   42
1  Sanjay  Satara   20
2   Smita  Sangli   25

In [21]:
df.tail(2)

         name   place  age
9   Chidambar    Pune   19
10    Subhash  Satara   45

In [22]:
df[-1:-4:-1][::-1]

         name    place  age
8      Sumeet  Solapur   21
9   Chidambar     Pune   19
10    Subhash   Satara   45

In [23]:
df[df.age>42]

       name   place  age
6   Supriya  Satara   45
10  Subhash  Satara   45

In [24]:
df.query('age>42')

       name   place  age
6   Supriya  Satara   45
10  Subhash  Satara   45

In [25]:
# i want name of an emp who is from Kolhapur 
df[df.place=='Kolhapur']['name']

4    Abhijeet
Name: name, dtype: object

In [26]:
#Count of Employee per place
#Return a Series containing counts of unique values.
df.place.value_counts()

Satara      3
Pune        3
Sangli      2
Solapur     2
Kolhapur    1
Name: place, dtype: int64

In [27]:
# List out unique places
df.place.unique()

array(['Pune', 'Satara', 'Sangli', 'Solapur', 'Kolhapur'], dtype=object)

In [28]:
# Count the unique places
df.place.nunique()

5

In [29]:
# Fetch records from place pune
df[df.place=='Pune']

        name place  age
0     Ashwin  Pune   42
5    Mahadev  Pune   24
9  Chidambar  Pune   19

In [30]:
df.query("place=='Pune'")

        name place  age
0     Ashwin  Pune   42
5    Mahadev  Pune   24
9  Chidambar  Pune   19

In [31]:
#fetch name of emp. whose age is min
#df[df.age==19]['name']
df[df['age']==min(df.age)]

        name place  age
9  Chidambar  Pune   19

In [32]:
# Find record of employee having name length greater than five
df[df.name.map(lambda x:len(x)>6)]

         name     place  age
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
9   Chidambar      Pune   19
10    Subhash    Satara   45

In [33]:
df[df.name.apply(len)>6]

         name     place  age
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
9   Chidambar      Pune   19
10    Subhash    Satara   45

In [34]:
df[df.name.str.startswith('S')]

       name    place  age
1    Sanjay   Satara   20
2     Smita   Sangli   25
6   Supriya   Satara   45
8    Sumeet  Solapur   21
10  Subhash   Satara   45

In [35]:
df[df.age%4==0]

       name     place  age
1    Sanjay    Satara   20
3   Vaibhav   Solapur   36
4  Abhijeet  Kolhapur   28
5   Mahadev      Pune   24

In [36]:
df.place.str.replace('Pune','1').replace('Satara','2')

0            1
1            2
2       Sangli
3      Solapur
4     Kolhapur
5            1
6            2
7       Sangli
8      Solapur
9            1
10           2
Name: place, dtype: object

In [37]:
df.place.map({'Pune':1,'Satara':2})     # When you replace all values NaN will get removed and values are in integer format

0     1.0
1     2.0
2     NaN
3     NaN
4     NaN
5     1.0
6     2.0
7     NaN
8     NaN
9     1.0
10    2.0
Name: place, dtype: float64

In [38]:
def sample(s):
    if s=='Pune':
        return 1
df.place.apply(sample)

0     1.0
1     NaN
2     NaN
3     NaN
4     NaN
5     1.0
6     NaN
7     NaN
8     NaN
9     1.0
10    NaN
Name: place, dtype: float64

In [39]:
# I want the records of emp whose age is greater than 30
df[df.age>30]

       name    place  age
0    Ashwin     Pune   42
3   Vaibhav  Solapur   36
6   Supriya   Satara   45
10  Subhash   Satara   45

In [40]:
# I want the emp whose name starts with A
df[df.name.str.startswith('A')]

       name     place  age
0    Ashwin      Pune   42
4  Abhijeet  Kolhapur   28

In [41]:
# i want the place of an emp whose name endswith a
df[df.name.str.endswith('a')]['place']

2    Sangli
6    Satara
Name: place, dtype: object

In [42]:
# what is age of Akshay
df[df.name=='Abhijeet']['age']

4    28
Name: age, dtype: int64

In [43]:
# who is from place Satara
df[df.place=='Satara']

       name   place  age
1    Sanjay  Satara   20
6   Supriya  Satara   45
10  Subhash  Satara   45

In [44]:
# i want record of emp whose age less than  or equal to 25
df[df.age>=25]

        name     place  age
0     Ashwin      Pune   42
2      Smita    Sangli   25
3    Vaibhav   Solapur   36
4   Abhijeet  Kolhapur   28
6    Supriya    Satara   45
7    Pallavi    Sangli   25
10   Subhash    Satara   45

In [45]:
# list out the name and age of emp from Sangli location
df[df.place=='Sangli'][['name','age']]

      name  age
2    Smita   25
7  Pallavi   25

In [46]:
# add a column with designation
df['designation']=['developer','tester','designer','analyser','developer','developer','tester','designer','analyser','developer','tester']
df

         name     place  age designation
0      Ashwin      Pune   42   developer
1      Sanjay    Satara   20      tester
2       Smita    Sangli   25    designer
3     Vaibhav   Solapur   36    analyser
4    Abhijeet  Kolhapur   28   developer
5     Mahadev      Pune   24   developer
6     Supriya    Satara   45      tester
7     Pallavi    Sangli   25    designer
8      Sumeet   Solapur   21    analyser
9   Chidambar      Pune   19   developer
10    Subhash    Satara   45      tester

In [47]:
df

         name     place  age designation
0      Ashwin      Pune   42   developer
1      Sanjay    Satara   20      tester
2       Smita    Sangli   25    designer
3     Vaibhav   Solapur   36    analyser
4    Abhijeet  Kolhapur   28   developer
5     Mahadev      Pune   24   developer
6     Supriya    Satara   45      tester
7     Pallavi    Sangli   25    designer
8      Sumeet   Solapur   21    analyser
9   Chidambar      Pune   19   developer
10    Subhash    Satara   45      tester

In [48]:
#find out is there any duplicate entry
#df.duplicated(keep='last')
df[df.duplicated('place')]

         name    place  age designation
5     Mahadev     Pune   24   developer
6     Supriya   Satara   45      tester
7     Pallavi   Sangli   25    designer
8      Sumeet  Solapur   21    analyser
9   Chidambar     Pune   19   developer
10    Subhash   Satara   45      tester

In [57]:
df[df['place'].duplicated()]

         name     place   age designation
5     Mahadev      Pune  24.0   developer
6     Supriya    Satara  45.0      tester
7     Pallavi    Sangli  25.0    designer
8      Sumeet   Solapur  21.0    analyser
9   Chidambar      Pune  19.0   developer
10    Subhash    Satara  45.0      tester
11     Meenal  Kolhapur   NaN         NaN

In [59]:
# To drop duplicated records
df.drop_duplicates('place')

       name     place   age designation
0    Ashwin      Pune  42.0   developer
1    Sanjay    Satara  20.0      tester
2     Smita    Sangli  25.0    designer
3   Vaibhav   Solapur  36.0    analyser
4  Abhijeet  Kolhapur  28.0   developer

In [60]:
df=df.append({'name':'Meenal','place':'Kolhapur'},ignore_index=True)
df

         name     place   age designation
0      Ashwin      Pune  42.0   developer
1      Sanjay    Satara  20.0      tester
2       Smita    Sangli  25.0    designer
3     Vaibhav   Solapur  36.0    analyser
4    Abhijeet  Kolhapur  28.0   developer
5     Mahadev      Pune  24.0   developer
6     Supriya    Satara  45.0      tester
7     Pallavi    Sangli  25.0    designer
8      Sumeet   Solapur  21.0    analyser
9   Chidambar      Pune  19.0   developer
10    Subhash    Satara  45.0      tester
11     Meenal  Kolhapur   NaN         NaN
12     Meenal  Kolhapur   NaN         NaN

In [50]:
#df=df.append({'name':'Meenal','place':'Kolhapur'},ignore_index=True)
df.age.fillna(0)

0     42.0
1     20.0
2     25.0
3     36.0
4     28.0
5     24.0
6     45.0
7     25.0
8     21.0
9     19.0
10    45.0
11     0.0
Name: age, dtype: float64

In [61]:
# find out the count of null/NaN values
df.isna()['age'].sum()

2

In [68]:
# To get age of smita
df[df.name=='Smita']['age']

2    25.0
Name: age, dtype: float64

# Groupby
"""
A groupby operation involves some combination of splitting the object, 
applying a function, and combining the results. 
This can be used to group large amounts of data and compute operations on these groups.
"""

In [2]:
#Splitting or Aggregations or Fiteration or Transformation
import pandas as pd

ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df1 = pd.DataFrame(ipl_data)
df1

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [3]:
# I want the unique Team Names/find out total teams in dataset
df1.Team.unique()

array(['MI', 'Devils', 'Kings', 'CSK', 'Royals'], dtype=object)

In [4]:
# Find out the total number of teams
df1.Team.nunique()

5

In [5]:
# Find out the total occurance (teamwise)
df1.Team.value_counts()

MI        4
CSK       3
Royals    2
Devils    2
Kings     1
Name: Team, dtype: int64

In [6]:
# Groupby on Team column
df1.groupby('Team')       # It gives object. To see contents type cast it in to list

In [7]:
l1 = list(df1.groupby('Team'))
l1

[('CSK',   Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788), ('Devils',      Team  Rank  Year  Points
  2  Devils     2  2014     863
  3  Devils     3  2015     673), ('Kings',     Team  Rank  Year  Points
  4  Kings     3  2014     741), ('MI',    Team  Rank  Year  Points
  0    MI     1  2014     876
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690), ('Royals',       Team  Rank  Year  Points
  9   Royals     4  2014     701
  10  Royals     1  2015     804)]

In [8]:
# If i want only team from a tuple
for i in l1:
    print(i[0])          # i[1]    for DataFrame

CSK
Devils
Kings
MI
Royals

In [9]:
for team,data in l1:
    print(team)

CSK
Devils
Kings
MI
Royals

In [10]:
#fetch data of only MI
for team,data in l1:
    if team == 'MI':
        print(data)

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [11]:
df1.groupby('Team').get_group('MI')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [12]:
#it gives team name : index(where it is present)
df1.groupby('Team').groups

{'CSK': Int64Index([5, 6, 7], dtype='int64'),
 'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4], dtype='int64'),
 'MI': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64')}

In [13]:
df1.groupby('Year').mean()      # IT gives mean of all numeric columns

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [14]:
df1.groupby('Year')['Points'].mean()

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [15]:
# To get year with minimum mean
df1.groupby('Year')['Points'].mean().min()

725.0

In [16]:
#take sum of all points yearwise
df1.groupby('Year')['Points'].sum()

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [17]:
#fetch only teams with rank 1
df1.groupby('Rank').get_group(1)

      Team  Rank  Year  Points
0       MI     1  2014     876
6      CSK     1  2016     756
7      CSK     1  2017     788
10  Royals     1  2015     804

In [18]:
#fetch 1st entry of each category according to Team with Rank groupby
df1.groupby('Rank').first()

        Team  Year  Points
Rank
1         MI  2014     876
2         MI  2015     789
3     Devils  2015     673
4        CSK  2015     812

In [19]:
#fetch last entry of each category according to Team with Rank groupby
df1.groupby('Rank').last()

        Team  Year  Points
Rank
1     Royals  2015     804
2         MI  2017     690
3      Kings  2014     741
4     Royals  2014     701

In [20]:
#fetch second and third entry of each category according to Team with Rank groupby
l2 = list(df1.groupby('Rank')) 
for i in l2:
    print(i[1][1:3])

  Team  Rank  Year  Points
6  CSK     1  2016     756
7  CSK     1  2017     788
     Team  Rank  Year  Points
2  Devils     2  2014     863
8      MI     2  2016     694
    Team  Rank  Year  Points
4  Kings     3  2014     741
     Team  Rank  Year  Points
9  Royals     4  2014     701

In [21]:
# Multiple column groupby
df1.groupby(['Team','Year']).groups

{('CSK', 2015): Int64Index([5], dtype='int64'),
 ('CSK', 2016): Int64Index([6], dtype='int64'),
 ('CSK', 2017): Int64Index([7], dtype='int64'),
 ('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('MI', 2014): Int64Index([0], dtype='int64'),
 ('MI', 2015): Int64Index([1], dtype='int64'),
 ('MI', 2016): Int64Index([8], dtype='int64'),
 ('MI', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64')}

# Iterations over Group

In [22]:
#Iterating through groups
#Problem statement: Identify yearwise records  from whole dataset
list(df1.groupby('Year'))

[(2014,      Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701), (2015,       Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804), (2016,   Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694), (2017,    Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [23]:
# To get records of year 2017
l3 = list(df1.groupby('Year'))
for v in l3:
    if v[0]==2017:
        print(v[1])

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

In [24]:
#fetch record of 2015 without using groupby
df1[df1.Year==2015]

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [25]:
df1.query("Year==2015")

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [26]:
df1[df1.loc[:,'Year']==2015]

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [27]:
df1[df1.iloc[:,2]==2015]

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [28]:
df1.groupby('Year').get_group(2015)

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [29]:
#Selecting a perticular group
df1.groupby('Team').get_group('MI')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [30]:
# i want the team who stood 1st max times in ipl
df1.groupby('Rank').get_group(1)['Team'].value_counts()

CSK       2
MI        1
Royals    1
Name: Team, dtype: int64

# Aggregate operations using groupby
It is for applying multiple functions over selected column or columns

In [31]:
import numpy as np
#Aggregations #sum mean median mode std
#Aggregations work only on Numeric fields
df1.groupby('Year')['Points'].agg(np.sum)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [32]:
df1.groupby('Year')['Points'].agg(np.size)     # How many occurances of year

Year
2014    4
2015    4
2016    2
2017    2
Name: Points, dtype: int64

In [33]:
df1.Team.value_counts()

MI        4
CSK       3
Royals    2
Devils    2
Kings     1
Name: Team, dtype: int64

In [34]:
#Applying Multiple Aggregation Functions at Once
#grouped = df.groupby('Team')
#grouped['Points'].agg([np.sum, np.mean, np.std])

df1.groupby('Team')['Points','Rank'].agg([sum,np.mean,max])

       Points                  Rank
          sum        mean  max  sum  mean max
Team
CSK      2356  785.333333  812    6  2.00   4
Devils   1536  768.000000  863    5  2.50   3
Kings     741  741.000000  741    3  3.00   3
MI       3049  762.250000  876    7  1.75   2
Royals   1505  752.500000  804    5  2.50   4

## Transformation calling a function over the selected data

In [35]:
#transforming Points column by addition of 100 points in each a
df1.groupby('Year')['Points'].transform(lambda x:x+100)

0     976
1     889
2     963
3     773
4     841
5     912
6     856
7     888
8     794
9     801
10    904
11    790
Name: Points, dtype: int64

In [36]:
def add(x):
    return x+100
df1.groupby('Year')['Points'].transform(add)

0     976
1     889
2     963
3     773
4     841
5     912
6     856
7     888
8     794
9     801
10    904
11    790
Name: Points, dtype: int64

In [37]:
# df.Points+100

In [38]:
#Assignment:
# I want to give the +10 exxtra points to csk use transform
df1.groupby('Team').get_group('CSK')['Points'].transform(lambda x:x+10)

5    822
6    766
7    798
Name: Points, dtype: int64

In [39]:
# I want to give extra +10 point only to the teams from year 2015
df1.groupby('Year').get_group((2015))['Points'].transform(lambda x:x+10)

1     799
3     683
5     822
10    814
Name: Points, dtype: int64

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('Flipkart.csv')
df

,Brand,Model,Color,Memory,Storage,Rating,Selling Price,Original Price
0,OPPO,A53,Moonlight Black,4 GB,64 GB,4.5,11990.0,15990.0
1,OPPO,A53,Mint Cream,4 GB,64 GB,4.5,11990.0,15990.0
2,OPPO,A53,Moonlight Black,6 GB,128 GB,4.3,13990.0,17990.0
3,OPPO,A53,Mint Cream,6 GB,128 GB,4.3,13990.0,17990.0
4,OPPO,A53,Electric Black,4 GB,64 GB,4.5,11990.0,15990.0
...,...,...,...,...,...,...,...,...
2642,Xiaomi,Redmi Y3,Bold Red,4 GB,64 GB,4.3,12999.0,13999.0
2643,Xiaomi,Redmi Y3,Elegant Blue,3 GB,32 GB,4.3,9450.0,NaN
2644,Xiaomi,Redmi Y3,Elegant Blue,4 GB,64 GB,4.2,12999.0,NaN
2645,Xiaomi,Redmi Y3,Prime Black,3 GB,32 GB,4.2,9950.0,NaN
2646,Xiaomi,Redmi Y3,Prime Black,4 GB,64 GB,4.3,12499.0,13999.0

In [4]:
df.columns

Index(['Brand', 'Model', 'Color', 'Memory', 'Storage', 'Rating',
       'Selling Price', 'Original Price'],
      dtype='object')

In [5]:
df.rename(columns={'Selling Price':'Selling_Price','Original Price':'Original_Price'},inplace=True)
df

,Brand,Model,Color,Memory,Storage,Rating,Selling_Price,Original_Price
0,OPPO,A53,Moonlight Black,4 GB,64 GB,4.5,11990.0,15990.0
1,OPPO,A53,Mint Cream,4 GB,64 GB,4.5,11990.0,15990.0
2,OPPO,A53,Moonlight Black,6 GB,128 GB,4.3,13990.0,17990.0
3,OPPO,A53,Mint Cream,6 GB,128 GB,4.3,13990.0,17990.0
4,OPPO,A53,Electric Black,4 GB,64 GB,4.5,11990.0,15990.0
...,...,...,...,...,...,...,...,...
2642,Xiaomi,Redmi Y3,Bold Red,4 GB,64 GB,4.3,12999.0,13999.0
2643,Xiaomi,Redmi Y3,Elegant Blue,3 GB,32 GB,4.3,9450.0,NaN
2644,Xiaomi,Redmi Y3,Elegant Blue,4 GB,64 GB,4.2,12999.0,NaN
2645,Xiaomi,Redmi Y3,Prime Black,3 GB,32 GB,4.2,9950.0,NaN
2646,Xiaomi,Redmi Y3,Prime Black,4 GB,64 GB,4.3,12499.0,13999.0

In [8]:
df.query("Memory>'4 GB' & 'Selling_price'>'15000'")

,Brand,Model,Color,Memory,Storage,Rating,Selling_Price,Original_Price
2,OPPO,A53,Moonlight Black,6 GB,128 GB,4.3,13990.0,17990.0
3,OPPO,A53,Mint Cream,6 GB,128 GB,4.3,13990.0,17990.0
5,OPPO,A53,Electric Black,6 GB,128 GB,4.3,13990.0,17990.0
12,OPPO,A53s 5G,Crystal Blue,6 GB,128 GB,4.3,15990.0,16990.0
13,OPPO,A53s 5G,Ink Black,6 GB,128 GB,4.3,15990.0,16990.0
...,...,...,...,...,...,...,...,...
2609,Xiaomi,Redmi Note 7 Pro,Neptune Blue,6 GB,128 GB,3.8,16399.0,NaN
2610,Xiaomi,Redmi Note 7 Pro,Neptune Blue,6 GB,64 GB,4.3,16999.0,NaN
2611,Xiaomi,Redmi Note 7 Pro,Space Black,6 GB,128 GB,4.1,17999.0,NaN
2613,Xiaomi,Redmi Note 7 Pro,Space Black,6 GB,64 GB,4.5,15999.0,NaN
2627,Xiaomi,Redmi Note 9 Pro,Champagne Gold,6 GB,128 GB,4.3,18499.0,18999.0

In [24]:
df.query('Memory>"4 GB"').query('Selling_Price>15000')

,Brand,Model,Color,Memory,Storage,Rating,Selling_Price,Original_Price
12,OPPO,A53s 5G,Crystal Blue,6 GB,128 GB,4.3,15990.0,16990.0
13,OPPO,A53s 5G,Ink Black,6 GB,128 GB,4.3,15990.0,16990.0
15,OPPO,A53s 5G,Crystal Blue,8 GB,128 GB,4.3,17990.0,18990.0
16,OPPO,A53s 5G,Ink Black,8 GB,128 GB,4.3,17990.0,18990.0
20,OPPO,A74 5G,Fantastic Purple,6 GB,128 GB,4.3,18979.0,NaN
...,...,...,...,...,...,...,...,...
2609,Xiaomi,Redmi Note 7 Pro,Neptune Blue,6 GB,128 GB,3.8,16399.0,NaN
2610,Xiaomi,Redmi Note 7 Pro,Neptune Blue,6 GB,64 GB,4.3,16999.0,NaN
2611,Xiaomi,Redmi Note 7 Pro,Space Black,6 GB,128 GB,4.1,17999.0,NaN
2613,Xiaomi,Redmi Note 7 Pro,Space Black,6 GB,64 GB,4.5,15999.0,NaN
2627,Xiaomi,Redmi Note 9 Pro,Champagne Gold,6 GB,128 GB,4.3,18499.0,18999.0

In [25]:
df.Rating.apply(lambda x:x+10)

0       14.5
1       14.5
2       14.3
3       14.3
4       14.5
        ...
2642    14.3
2643    14.3
2644    14.2
2645    14.2
2646    14.3
Name: Rating, Length: 2647, dtype: float64

In [28]:
l = df[df.Selling_Price>13000].Selling_Price.apply(lambda x:x+x*0.08)
l

2       15109.20
3       15109.20
5       15109.20
12      17269.20
13      17269.20
          ...
2626    17277.84
2627    19978.92
2628    16198.92
2629    17807.04
2630    19429.20
Name: Selling_Price, Length: 1512, dtype: float64

In [29]:
newdf = pd.DataFrame({'Selling_Price':l})
newdf

      Selling_Price
2          15109.20
3          15109.20
5          15109.20
12         17269.20
13         17269.20
...             ...
2626       17277.84
2627       19978.92
2628       16198.92
2629       17807.04
2630       19429.20

[1512 rows x 1 columns]

In [30]:
df.update(newdf)
df

,Brand,Model,Color,Memory,Storage,Rating,Selling_Price,Original_Price
0,OPPO,A53,Moonlight Black,4 GB,64 GB,4.5,11990.0,15990.0
1,OPPO,A53,Mint Cream,4 GB,64 GB,4.5,11990.0,15990.0
2,OPPO,A53,Moonlight Black,6 GB,128 GB,4.3,15109.2,17990.0
3,OPPO,A53,Mint Cream,6 GB,128 GB,4.3,15109.2,17990.0
4,OPPO,A53,Electric Black,4 GB,64 GB,4.5,11990.0,15990.0
...,...,...,...,...,...,...,...,...
2642,Xiaomi,Redmi Y3,Bold Red,4 GB,64 GB,4.3,12999.0,13999.0
2643,Xiaomi,Redmi Y3,Elegant Blue,3 GB,32 GB,4.3,9450.0,NaN
2644,Xiaomi,Redmi Y3,Elegant Blue,4 GB,64 GB,4.2,12999.0,NaN
2645,Xiaomi,Redmi Y3,Prime Black,3 GB,32 GB,4.2,9950.0,NaN
2646,Xiaomi,Redmi Y3,Prime Black,4 GB,64 GB,4.3,12499.0,13999.0

In [44]:
# df.Selling_Price = df.Selling_Price.where(df.Selling_Price<13000,df.Selling_Price + df.Selling_Price*0.08)
# df

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2647 entries, 0 to 2646
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Brand           2647 non-null   object
 1   Model           2645 non-null   object
 2   Color           2505 non-null   object
 3   Memory          2605 non-null   object
 4   Storage         2568 non-null   object
 5   Rating          2647 non-null   float64
 6   Selling_Price   2644 non-null   float64
 7   Original_Price  969 non-null    float64
dtypes: float64(3), object(5)
memory usage: 165.6+ KB

In [33]:
df.Original_Price.fillna(value=0,inplace=True)
df.Selling_Price.fillna(value=0,inplace=True)

In [34]:
df.Original_Price-df.Selling_Price

0        4000.0
1        4000.0
2        2880.8
3        2880.8
4        4000.0
         ...
2642     1000.0
2643    -9450.0
2644   -12999.0
2645    -9950.0
2646     1500.0
Length: 2647, dtype: float64

In [35]:
df.groupby(['Brand','Model']).get_group(('ASUS', '6Z '))

,Brand,Model,Color,Memory,Storage,Rating,Selling_Price,Original_Price
390,ASUS,6Z,Black,6 GB,64 GB,4.3,38878.92,0.0
404,ASUS,6Z,Silver,6 GB,128 GB,4.3,42118.92,0.0
426,ASUS,6Z,Silver,8 GB,256 GB,4.3,47518.92,0.0
428,ASUS,6Z,Silver,6 GB,64 GB,4.3,38878.92,0.0
447,ASUS,6Z,Matte Black,8 GB,256 GB,4.3,47518.92,0.0
462,ASUS,6Z,Black,8 GB,256 GB,4.3,47518.92,0.0
465,ASUS,6Z,Black,6 GB,128 GB,4.3,42118.92,0.0

In [36]:
#df.groupby(['Brand','Model']).groups

In [37]:
df.Rating.transform(lambda x: x+10)

0       14.5
1       14.5
2       14.3
3       14.3
4       14.5
        ...
2642    14.3
2643    14.3
2644    14.2
2645    14.2
2646    14.3
Name: Rating, Length: 2647, dtype: float64

In [42]:
df

,Brand,Model,Color,Memory,Storage,Rating,Selling_Price,Original_Price
0,OPPO,A53,Moonlight Black,4 GB,64 GB,4.5,13985.136,15990.0
1,OPPO,A53,Mint Cream,4 GB,64 GB,4.5,13985.136,15990.0
2,OPPO,A53,Moonlight Black,6 GB,128 GB,4.3,15109.200,17990.0
3,OPPO,A53,Mint Cream,6 GB,128 GB,4.3,15109.200,17990.0
4,OPPO,A53,Electric Black,4 GB,64 GB,4.5,13985.136,15990.0
...,...,...,...,...,...,...,...,...
2642,Xiaomi,Redmi Y3,Bold Red,4 GB,64 GB,4.3,14038.920,13999.0
2643,Xiaomi,Redmi Y3,Elegant Blue,3 GB,32 GB,4.3,11022.480,0.0
2644,Xiaomi,Redmi Y3,Elegant Blue,4 GB,64 GB,4.2,14038.920,0.0
2645,Xiaomi,Redmi Y3,Prime Black,3 GB,32 GB,4.2,11605.680,0.0
2646,Xiaomi,Redmi Y3,Prime Black,4 GB,64 GB,4.3,13498.920,13999.0